# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_kubernetes_cluster.k6tests: Reading...
data.azurerm_monitor_data_collection_endpoint.k6tests: Reading...
data.azurerm_monitor_data_collection_rule.k6tests: Reading...
data.azurerm_monitor_data_collection_endpoint.k6tests: Read complete after 1s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw-F7sT_norwayeast_managed/providers/Microsoft.Insights/dataCollectionEndpoints/k6tests-amw-F7sT]
data.azurerm_monitor_data_collection_rule.k6tests: Read complete after 1s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.Insights/dataCollectionRules/k6tests-dcr-F7sT]
data.azurerm_kubernetes_cluster.k6tests: Read complete after 2s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster-F7sT]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.services.azuread_application.prometheus will be created
  + resource "azuread_application" "prometheus" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "adminservicestest-k6tests-prometheus-F7sT"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)
    }

  # module.services.azuread_application_federated_identity_credential.prometheus will be created
  + resource "azuread_application_federated_identity_credential" "prometheus" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + display_name   = "adminservicestest-k6tests-prometheus-F7sT"
      + id             = (known after apply)
      + issuer         = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/ad6108ad-c807-45af-9f6e-7807f38ff4ea/"
      + subject        = "system:serviceaccount:monitoring:kube-prometheus-stack-prometheus"
    }

  # module.services.azuread_service_principal.prometheus will be created
  + resource "azuread_service_principal" "prometheus" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # module.services.azurerm_role_assignment.monitoring_metrics_publisher will be created
  + resource "azurerm_role_assignment" "monitoring_metrics_publisher" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Metrics Publisher"
      + scope                            = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw-F7sT_norwayeast_managed/providers/Microsoft.Insights/dataCollectionEndpoints/k6tests-amw-F7sT"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.services.helm_release.k6_operator will be created
  + resource "helm_release" "k6_operator" {
      + atomic                     = false
      + chart                      = "k6-operator"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "k6-operator"
      + namespace                  = "k6-operator-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                installCRDs: true
                
                namespace:
                  create: false
                
                prometheus:
                  enabled: true
            EOT,
        ]
      + verify                     = false
      + version                    = "3.11.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.services.helm_release.kube_prometheus_stack will be created
  + resource "helm_release" "kube_prometheus_stack" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kube-prometheus-stack"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = true
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "70.0.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.services.helm_release.prometheus_operator_crds will be created
  + resource "helm_release" "prometheus_operator_crds" {
      + atomic                     = false
      + chart                      = "prometheus-operator-crds"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus-operator-crds"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "18.0.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.services.helm_release.pyrra will be created
  + resource "helm_release" "pyrra" {
      + atomic                     = false
      + chart                      = "pyrra"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "pyrra"
      + namespace                  = "pyrra-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://rlex.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.14.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "genericRules.enabled"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.helm_release.sealed_secrets will be created
  + resource "helm_release" "sealed_secrets" {
      + atomic                     = false
      + chart                      = "sealed-secrets"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "sealedsecrets"
      + namespace                  = "sealedsecrets-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://bitnami-labs.github.io/sealed-secrets"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "2.17.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.services.kubernetes_cluster_role_v1.dev_access will be created
  + resource "kubernetes_cluster_role_v1" "dev_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "dev-access"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "configmaps",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
              + "delete",
            ]
        }
      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "pods",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + "k6.io",
            ]
          + resources  = [
              + "testruns",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
              + "create",
              + "update",
              + "patch",
              + "delete",
            ]
        }
      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "secrets",
            ]
          + verbs      = [
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + "bitnami.com",
            ]
          + resources  = [
              + "sealedsecrets",
            ]
          + verbs      = [
              + "list",
              + "watch",
              + "delete",
            ]
        }
    }

  # module.services.kubernetes_cluster_role_v1.sp_access will be created
  + resource "kubernetes_cluster_role_v1" "sp_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "github-sp-access"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "configmaps",
            ]
          + verbs      = [
              + "create",
              + "update",
              + "delete",
              + "get",
            ]
        }
      + rule {
          + api_groups = [
              + "bitnami.com",
            ]
          + resources  = [
              + "sealedsecrets",
            ]
          + verbs      = [
              + "create",
              + "update",
            ]
        }
      + rule {
          + api_groups = [
              + "k6.io",
            ]
          + resources  = [
              + "testruns",
            ]
          + verbs      = [
              + "create",
              + "update",
              + "get",
              + "list",
              + "watch",
              + "delete",
            ]
        }
      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "pods",
            ]
          + verbs      = [
              + "get",
              + "list",
            ]
        }
      + rule {
          + api_groups = [
              + null,
            ]
          + resources  = [
              + "pods/log",
            ]
          + verbs      = [
              + "get",
              + "list",
            ]
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["authentication.at22"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at22.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at22"
          + namespace        = "authentication"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["authentication.at23"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at23.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at23"
          + namespace        = "authentication"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["authentication.at24"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at24.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at24"
          + namespace        = "authentication"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["authentication.prod"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.altinn.no"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-prod"
          + namespace        = "authentication"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["authentication.tt02"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.tt02.altinn.no"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-tt02"
          + namespace        = "authentication"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["authentication.yt01"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.yt01.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-yt01"
          + namespace        = "authentication"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["core.at22"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at22.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at22"
          + namespace        = "core"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["core.at23"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at23.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at23"
          + namespace        = "core"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["core.at24"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at24.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at24"
          + namespace        = "core"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["core.prod"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.altinn.no"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-prod"
          + namespace        = "core"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["core.tt02"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.tt02.altinn.no"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-tt02"
          + namespace        = "core"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["core.yt01"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.yt01.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-yt01"
          + namespace        = "core"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["correspondence.at22"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at22.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at22"
          + namespace        = "correspondence"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["correspondence.at23"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at23.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at23"
          + namespace        = "correspondence"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["correspondence.at24"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at24.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at24"
          + namespace        = "correspondence"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["correspondence.prod"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.altinn.no"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-prod"
          + namespace        = "correspondence"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["correspondence.tt02"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.tt02.altinn.no"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-tt02"
          + namespace        = "correspondence"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["correspondence.yt01"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.yt01.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-yt01"
          + namespace        = "correspondence"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.at22"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at22.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at22"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.at23"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at23.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at23"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.at24"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at24.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at24"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.prod"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.altinn.no"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-prod"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.tt02"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.tt02.altinn.no"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-tt02"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.yt01"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.yt01.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-yt01"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.at22"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at22.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at22"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.at23"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at23.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at23"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.at24"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.at24.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at24"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.prod"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.altinn.no"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-prod"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.tt02"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.tt02.altinn.no"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-tt02"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.yt01"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      + data = {
          + "BASE_URL" = "https://platform.yt01.altinn.cloud"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-yt01"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_namespace.namespace["authentication"] will be created
  + resource "kubernetes_namespace" "namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "authentication"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_namespace.namespace["core"] will be created
  + resource "kubernetes_namespace" "namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "core"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_namespace.namespace["correspondence"] will be created
  + resource "kubernetes_namespace" "namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "correspondence"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_namespace.namespace["dialogporten"] will be created
  + resource "kubernetes_namespace" "namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_namespace.namespace["platform"] will be created
  + resource "kubernetes_namespace" "namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_role_binding_v1.dev_access["authentication"] will be created
  + resource "kubernetes_role_binding_v1" "dev_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "dev-access"
          + namespace        = "authentication"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "dev-access"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "Group"
          + name      = "5c42ac79-86e2-46d0-85d3-ae751dd5f057"
          + namespace = "authentication"
        }
    }

  # module.services.kubernetes_role_binding_v1.dev_access["core"] will be created
  + resource "kubernetes_role_binding_v1" "dev_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "dev-access"
          + namespace        = "core"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "dev-access"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "Group"
          + name      = "4dde4651-a9ca-4df1-9e05-216272284c7d"
          + namespace = "core"
        }
    }

  # module.services.kubernetes_role_binding_v1.dev_access["correspondence"] will be created
  + resource "kubernetes_role_binding_v1" "dev_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "dev-access"
          + namespace        = "correspondence"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "dev-access"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "Group"
          + name      = "954a4d24-8c7e-4382-9861-2b5d1a515253"
          + namespace = "correspondence"
        }
    }

  # module.services.kubernetes_role_binding_v1.dev_access["dialogporten"] will be created
  + resource "kubernetes_role_binding_v1" "dev_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "dev-access"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "dev-access"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "Group"
          + name      = "c403060d-5c8a-41b0-8c19-84fa60d0ce18"
          + namespace = "dialogporten"
        }
    }

  # module.services.kubernetes_role_binding_v1.sp_access["authentication"] will be created
  + resource "kubernetes_role_binding_v1" "sp_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "github-sp-access"
          + namespace        = "authentication"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "github-sp-access"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "Group"
          + name      = "328cbe61-aeb1-4782-bb36-d288c69b4f15"
          + namespace = "authentication"
        }
    }

  # module.services.kubernetes_role_binding_v1.sp_access["core"] will be created
  + resource "kubernetes_role_binding_v1" "sp_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "github-sp-access"
          + namespace        = "core"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "github-sp-access"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "Group"
          + name      = "e87d6f10-6fc0-4a09-a9b0-e8c994ed4052"
          + namespace = "core"
        }
    }

  # module.services.kubernetes_role_binding_v1.sp_access["correspondence"] will be created
  + resource "kubernetes_role_binding_v1" "sp_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "github-sp-access"
          + namespace        = "correspondence"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "github-sp-access"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "Group"
          + name      = "e36ca3b3-f495-45a5-bca4-4fc83424633f"
          + namespace = "correspondence"
        }
    }

  # module.services.kubernetes_role_binding_v1.sp_access["dialogporten"] will be created
  + resource "kubernetes_role_binding_v1" "sp_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "github-sp-access"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "github-sp-access"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "Group"
          + name      = "b22b612d-9dc5-4f8b-8816-e551749bd19c"
          + namespace = "dialogporten"
        }
    }

Plan: 54 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/k6tests-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/k6tests-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_k6tests-rg.tfstate.tfplan`